#include "sensor.h"

void sensor()
{
    if (RR == 1 && R == 1 && L == 1 && LL == 1) { // 如果四个传感器的电平都是高，表示小车在黑线上
        go(); // 调用go函数，控制电机向前运动
    }

    if (RR == 0 && R == 0 && L == 0 && LL == 0) { // 如果四个传感器的电平都是低，表示小车在黑色背景上
        stop(); // 调用stop函数，控制电机停止运动
    }

    if ((RR == 1 && R == 0 && L == 1 && LL == 1)||(RR == 0 && R == 1 && L == 1 && LL == 1) ){ // 如果右边的两个传感器的电平是高，左边的两个传感器之一的电平是低，表示小车偏离了黑线
        left(); // 调用left函数，控制电机向左转向

    }

    if ((RR == 1 && R == 1 && L == 0 && LL == 1)||(RR == 1 && R == 1 && L == 1 && LL == 0)) { // 如果左边的两个传感器的电平是高，右边的两个传感器之一的电平是低，表示小车偏离了黑线
        right(); // 调用right函数，控制电机向右转向
    }
}
